# Analyzing CIA Factbook Data Using SQL

### We begin by connecting to the database

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

We then load the information of the database and the table of interest.

In [ ]:
%%sql
SELECT *
FROM sqlite_master
WHERE type='table'

In [8]:
%%sql
SELECT *
FROM facts
LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Viewing the Minimum & Maximum values of Population and Population Growth

In [9]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

oh oh! There is a country with a value of 0 population and 7 Billion. Lets see where this values come from

In [10]:
%%sql
SELECT Name, Population
FROM facts
WHERE population = (SELECT MIN(population)
                   FROM facts)

Done.

[('Antarctica', 0)]

In [11]:
%%sql
SELECT Name, Population
FROM facts
WHERE population = (SELECT MAX(population)
                   FROM facts)

Done.

[('World', 7256490011)]

We can see that Antartica has population of 0, which after investigation was the value retrieved by the CIA and then a value from "World" which is the sum of population of the countries. 

We dont need population of the "World", so we remove it.

In [13]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts
WHERE Name IS NOT "World"

Done.

[(0, 1367485388, 0.0, 4.02)]

In [14]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts

Done.

[(62094928.32231405, 555093.546184739)]

In [16]:
%%sql
SELECT Name, population, area
FROM facts
WHERE population > (SELECT AVG(population)
                    FROM facts) AND area > (SELECT AVG(area)
                                           FROM facts)

Done.

[('Brazil', 204259812, 8515770),
 ('China', 1367485388, 9596960),
 ('Congo, Democratic Republic of the', 79375136, 2344858),
 ('Egypt', 88487396, 1001450),
 ('Ethiopia', 99465819, 1104300),
 ('France', 66553766, 643801),
 ('India', 1251695584, 3287263),
 ('Indonesia', 255993674, 1904569),
 ('Iran', 81824270, 1648195),
 ('Mexico', 121736809, 1964375),
 ('Nigeria', 181562056, 923768),
 ('Pakistan', 199085847, 796095),
 ('Russia', 142423773, 17098242),
 ('Turkey', 79414269, 783562),
 ('United States', 321368864, 9826675),
 ('European Union', 513949445, 4324782)]